blog/2021/lc-94-binary-tree-inorder-traversal.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 15:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>LC94. 二叉树的中序遍历</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">LC94. 二叉树的中序遍历</h1>
</header><p>
今天思考 LeetCode 题目：二叉树的中序遍历<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。
</p>

<div id="outline-container-org6e2d9a6" class="outline-2">
<h2 id="org6e2d9a6">题目描述</h2>
<div class="outline-text-2" id="text-org6e2d9a6">
<p>
给定一个二叉树的根节点 <code>root</code> ，返回它的 <b>中序</b> 遍历。
</p>

<p>
提示：
</p>

<ul class="org-ul">
<li>树中节点数目在范围 <code>[0, 100]</code> 内</li>
<li><code>-100 &lt;= Node.val &lt;= 100</code></li>
</ul>
</div>
</div>

<div id="outline-container-org93ee4c1" class="outline-2">
<h2 id="org93ee4c1">题解<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-org93ee4c1">
<p>
递归思想。
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #7c7565;">/**</span>
<span style="color: #7c7565;"> * Definition for a binary tree node.</span>
<span style="color: #7c7565;"> * function TreeNode(val, left, right) {</span>
<span style="color: #7c7565;"> *     this.val = (val===undefined ? 0 : val)</span>
<span style="color: #7c7565;"> *     this.left = (left===undefined ? null : left)</span>
<span style="color: #7c7565;"> *     this.right = (right===undefined ? null : right)</span>
<span style="color: #7c7565;"> * }</span>
<span style="color: #7c7565;"> */</span>
<span style="color: #7c7565;">/**</span>
<span style="color: #7c7565;"> * @param {TreeNode} root</span>
<span style="color: #7c7565;"> * @return {number[]}</span>
<span style="color: #7c7565;"> */</span>
<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">inorderTraversal</span> = <span style="color: #91a0b3;">function</span>(<span style="color: #aaca86;">root</span>) {
    <span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">res</span> = [];
    <span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">inorder</span> = (root) =&gt; {
        <span style="color: #91a0b3;">if</span> (!root) {
            <span style="color: #91a0b3;">return</span>;
        }
        inorder(root.left);
        res.push(root.val);
        inorder(root.right);
    }
    inorder(root);
    <span style="color: #91a0b3;">return</span> res;
};
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/binary-tree-inorder-traversal/">https://leetcode-cn.com/problems/binary-tree-inorder-traversal/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/binary-tree-inorder-traversal/solution/er-cha-shu-de-zhong-xu-bian-li-by-leetcode-solutio/">https://leetcode-cn.com/problems/binary-tree-inorder-traversal/solution/er-cha-shu-de-zhong-xu-bian-li-by-leetcode-solutio/</a></p></div></div>


</div>
</div></div>
</body>
</html>